; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-60)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b15)
    (on b15 b12)
    (on b12 b17)
    (on b17 b16)
    (on b16 b3)
    (on b3 b1)
    (on-table b1)
    (clear b10)
    (on b10 b2)
    (on b2 b14)
    (on b14 b9)
    (on b9 b11)
    (on b11 b6)
    (on b6 b13)
    (on b13 b18)
    (on b18 b4)
    (on b4 b7)
    (on b7 b5)
    (on-table b5))
 (:goal (and 
(on-table b17)
(on-table b16)
(on b10 b16)
(on b11 b17)
(on b2 b10)
(on b7 b11)
(on b15 b2)
(on b3 b7)
(on b4 b3)
(on b5 b15)
))
)

; plan
1. (unstack b8 b15)
   deleted: (on b8 b15) (clear b8) (arm-empty)
   added: (holding b8) (clear b15)
   goals met: 0 of 10
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 10
3. (unstack b15 b12)
   deleted: (on b15 b12) (clear b15) (arm-empty)
   added: (holding b15) (clear b12)
   goals met: 0 of 10
4. (stack b15 b8)
   deleted: (clear b8) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b8)
   goals met: 0 of 10
5. (unstack b12 b17)
   deleted: (on b12 b17) (clear b12) (arm-empty)
   added: (holding b12) (clear b17)
   goals met: 0 of 10
6. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 10
7. (unstack b17 b16)
   deleted: (on b17 b16) (clear b17) (arm-empty)
   added: (holding b17) (clear b16)
   goals met: 0 of 10
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 10
9. (unstack b16 b3)
   deleted: (on b16 b3) (clear b16) (arm-empty)
   added: (holding b16) (clear b3)
   goals met: 1 of 10
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 10
11. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 2 of 10
12. (stack b10 b16)
   deleted: (clear b16) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b16)
   goals met: 3 of 10
13. (unstack b2 b14)
   deleted: (on b2 b14) (clear b2) (arm-empty)
   added: (holding b2) (clear b14)
   goals met: 3 of 10
14. (stack b2 b10)
   deleted: (clear b10) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b10)
   goals met: 4 of 10
15. (unstack b15 b8)
   deleted: (on b15 b8) (clear b15) (arm-empty)
   added: (holding b15) (clear b8)
   goals met: 4 of 10
16. (stack b15 b2)
   deleted: (clear b2) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b2)
   goals met: 5 of 10
17. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 5 of 10
18. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 5 of 10
19. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 5 of 10
20. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 10
21. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 5 of 10
22. (stack b11 b17)
   deleted: (clear b17) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b17)
   goals met: 6 of 10
23. (unstack b6 b13)
   deleted: (on b6 b13) (clear b6) (arm-empty)
   added: (holding b6) (clear b13)
   goals met: 6 of 10
24. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 10
25. (unstack b13 b18)
   deleted: (on b13 b18) (clear b13) (arm-empty)
   added: (holding b13) (clear b18)
   goals met: 6 of 10
26. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 6 of 10
27. (unstack b18 b4)
   deleted: (on b18 b4) (clear b18) (arm-empty)
   added: (holding b18) (clear b4)
   goals met: 6 of 10
28. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 6 of 10
29. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 6 of 10
30. (stack b4 b12)
   deleted: (clear b12) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b12)
   goals met: 6 of 10
31. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 6 of 10
32. (stack b7 b11)
   deleted: (clear b11) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b11)
   goals met: 7 of 10
33. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 7 of 10
34. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 8 of 10
35. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 8 of 10
36. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 9 of 10
37. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 10
38. (stack b5 b15)
   deleted: (clear b15) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b15)
   goals met: 10 of 10
